Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The `mp.jwt.verify.publickey` config property allows the public key text to be supplied as a string. The public key is parsed from the supplied string in the order defined in the <<supported-public-key-formats>> section.
ja_jp: `mp.jwt.verify.publickey` 設定プロパティーを使用すると、公開鍵テキスト自体を文字列として提供できます。公開鍵は、<<supported-public-key-formats>> セクションで定義された順序で、提供された文字列から解析されます。

source: The `mutable-jar` is then built in the same way that a regular Quarkus jar is built, i.e. by issuing:
ja_jp: `mutable-jar` は、通常のQuarkus jarをビルドするのと同じ方法でビルドできます。つまり、次を実行します。

source: The `my-redis-client` name must correspond to the Redis client config key specified with `quarkus.redis.my-redis-client.*` configuration properties.
ja_jp: `my-redis-client` の名前は、 `quarkus.redis.my-redis-client.*` 設定プロパティーで指定された Redis クライアント設定キーに対応している必要があります。

source: The `name` column has a `not null` constraint because of the `@NotNull` constraint, and the length of the values is limited to `50` because of the `@Size(max=50)` constraint.
ja_jp: `name` カラムには `@NotNull` 制約があるため `not null` 制約が付き、値の長さは `@Size(max=50)` 制約により `50` に制限されます。

source: The `name` field will contain the data contained in the part of HTTP request called `description` (because link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestForm.html[`@RestForm`] does not define a value, the field name is used), while the `file` field will contain data about the uploaded file in the `image` part of HTTP request.
ja_jp: `name` フィールドには、HTTP リクエストの `description` という部分に含まれるデータが入ります (link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestForm.html[`@RestForm`] は値を定義しないため、フィールド名が使用されます)。一方 `file` フィールドには、HTTP リクエストの `image` 部分にアップロードしたファイルに関するデータが格納されます。

source: The `name` of `@QuarkusMain` must be unique (including the default of the empty string). If you have multiple `@QuarkusMain` annotations in your application the build will fail if the names are not unique.
ja_jp: `@QuarkusMain` の `name` は一意である必要があります(デフォルトの空文字列を含む)。アプリケーション内に複数の `@QuarkusMain` アノテーションがある場合、名前が一意でないとビルドに失敗します。

source: The `name` parameter is passed in.
ja_jp: `name` パラメーターが渡されます。

source: The `name` parameter of the mojo is optional. If you do not specify it on the command line, the plugin will derive it from `extensionId` by replacing dashes with spaces and uppercasing each token. So you may consider omitting explicit `name` in some cases.
ja_jp: mojoの `name` パラメータはオプションです。コマンドラインで指定しなかった場合、プラグインは `extensionId` からダッシュをスペースに置き換え、各トークンを大文字にすることで導出します。そのため、場合によっては明示的な `name` を省略することも考えられます。

source: The `name` will be resolved against the `item.parent`.
ja_jp: `name` は `item.parent` に対して解決されます。

source: The `namespace` attribute will always be provided automatically by Dev UI.
ja_jp: `namespace` 属性は、Dev UI によって常に自動的に提供されます。

source: The `order` - the order of the route when several routes are involved in handling the incoming request. Must be positive for regular user routes.
ja_jp: `order` - 受信リクエストの処理に複数のルートが関与している場合のルートの順序。通常のユーザールートでは正である必要があります。

source: The `org.eclipse.microprofile.config.ConfigProvider.getConfig()` API allows to access the Config API programmatically. This API is mostly useful in situations where CDI injection is not available.
ja_jp: `org.eclipse.microprofile.config.ConfigProvider.getConfig()` APIを使用すると、Config APIにプログラムでアクセスすることができます。このAPIは、CDIインジェクションが利用できない状況で主に役立ちます。

source: The `ownerName` DTO constructor's parameter will be loaded from the `owner.name` HQL property.
ja_jp: `ownerName` DTOコンストラクタのパラメータは `owner.name` HQLプロパティから読み込まれます。

source: The `params` annotation attribute specifies that user principal name should be passed to the `BeanParamPermissionChecker#canSayHello` method. Other `BeanParamPermissionChecker#canSayHello` method parameters like `customAuthorizationHeader` and `query` are matched automatically. Quarkus identifies the `BeanParamPermissionChecker#canSayHello` method parameters among `beanParam` fields and their public accessors. To avoid ambiguous resolution, automatic detection only works for the `beanParam` fields. For that reason, we had to specify path to the user principal name explicitly.
ja_jp: `params` アノテーション属性は、ユーザープリンシパル名を `BeanParamPermissionChecker#canSayHello` メソッドに渡すことを指定します。 `customAuthorizationHeader` や `query` などの他の `BeanParamPermissionChecker#canSayHello` メソッドパラメーターは自動的に一致します。 Quarkus は、 `beanParam` フィールドとそのパブリックアクセサーの中から `BeanParamPermissionChecker#canSayHello` メソッドパラメーターを識別します。 あいまいな解決を避けるため、自動検出は `beanParam` フィールドに対してのみ機能します。 そのため、ユーザープリンシパル名へのパスを明示的に指定する必要がありました。

source: The `path` - for routing by path, using the https://vertx.io/docs/vertx-web/java/#_capturing_path_parameters[Vert.x Web format]
ja_jp: `path`- https://vertx.io/docs/vertx-web/java/#_capturing_path_parameters[Vert.x Web フォーマット] を使用したパスによるルーティング用

source: The `path` value is used as a prefix for any route method declared on the class where `Route#path()` is used.
ja_jp: `path` 値は、 `Route#path()` が使用されるクラスで宣言されたルートメソッドの接頭辞として使用されます。

source: The `perf record` command above takes `1009` samples per second. Increasing this value means more samples are gathered, which can end up affecting the runtime performance. This also increases the amount of data generated. The more data generated, the longer it takes to process it, but the more precision you get on what the application is doing. So, finding the right value is a balancing act.
ja_jp: 上記の `perf record` コマンドは、1 秒あたり 1009 サンプルを取得します。この値を大きくすると、より多くのサンプルが収集されることを意味し、実行時のパフォーマンスに影響を与える可能性があります。これにより、生成されるデータの量も増加します。生成されるデータが多いほど、処理に時間がかかりますが、アプリケーションが行っていることをより正確に把握できます。したがって、適切な値を見つけることは、バランスをとる作業です。

source: The `pom.xml` file contains:
ja_jp: `pom.xml` ファイルには以下が含まれます。

source: The `pom.xml` is importing all the Quarkus extensions and dependencies you need.
ja_jp: `pom.xml` 、必要なQuarkusのエクステンションや依存関係をすべてインポートしています。

source: The `pom.xml` you generated in the previous step pulls in the `azure-functions-maven-plugin`. Running maven install generates config files and a staging directory required by the `azure-functions-maven-plugin`. Here's how to execute it.
ja_jp: 前のステップで生成した `pom.xml` は、 `azure-functions-maven-plugin` .maven install を実行すると、設定ファイルと `azure-functions-maven-plugin` によって必要とされるステージングディレクトリーが生成されます。実行方法は以下の通りです。

source: The `prepare` command does the following:
ja_jp: `prepare` コマンドは以下を実行します。

source: The `process` method is called for every AMQP message from the `quote-requests` queue, and will send a `Quote` object to the `quotes` queue.
ja_jp: `process` メソッドは、 `quote-requests` キューからのすべての AMQP メッセージに対して呼び出され、 `Quote` オブジェクトを `quotes` キューに送信します。

source: The `process` method is called for every RabbitMQ message from the `quote-requests` queue, and will send a `Quote` object to the `quotes` exchange.
ja_jp: `process` メソッドは、 `quote-requests` キューからの RabbitMQ のメッセージごとに呼び出され、 `Quote` オブジェクトを `quotes` エクスチェンジに送信します。

source: The `prod` part of the `quarkus-prod-config-dump` file name refers to the Quarkus build mode, indicating that the dump was taken for the production build.
ja_jp: `quarkus-prod-config-dump` ファイル名の `prod` 部分は Quarkus ビルドモードを参照します。これは、ダンプが実稼働環境用のビルドのために取得されたことを示します。

source: The `produces` attribute is an array. When you pass a single value you can omit the "{" and "}". Note that `"application/json"` must be the first value in the array.
ja_jp: `produces` 属性は配列です。単一の値を渡す場合は、{" と "}" を省略できます。 `"application/json"` は配列の最初の値でなければならないことに注意してください。

source: The `produces` attribute is an array. When you pass a single value you can omit the "{" and "}". Note that `"text/event-stream"` must be the first value in the array.
ja_jp: `produces` 属性は配列です。単一の値を渡す場合は、{" と "}" を省略できます。 `"text/event-stream"` は配列の最初の値でなければならないことに注意してください。

source: The `produces` attribute is an array. When you pass a single value you can omit the "{" and "}". Note that `"application/x-ndjson"` must be the first value in the array.
ja_jp: `produces` 属性は配列です。単一の値を渡す場合は、{" と "}" を省略できます。 `"application/x-ndjson"` は配列の最初の値でなければならないことに注意してください。

source: The `protected.hbs` has been converted to the `userEmail.html` Qute template and moved to the `src/main/templates` directory. It has been updated to follow Qute rules:
ja_jp: `protected.hbs` は `userEmail.html` という Qute テンプレートに変換され、 `src/main/resources/templates` ディレクトリーに移動されました。Qute のルールに従って更新されています。

source: The `protobuf-maven-plugin` generates stub classes from your gRPC service definition (`proto` files).
ja_jp: `protobuf-maven-plugin` は、gRPC サービス定義 (`proto` ファイル) からスタブクラスを生成します。

source: The `protobuf-maven-plugin` that generates stub classes from your gRPC service definition (`proto` files).
ja_jp: gRPCサービス定義( `proto` ファイル)からスタブクラスを生成する `protobuf-maven-plugin`

source: The `quarkiverse-parent` artifact (inherited by each extension in Quarkiverse) enables plugins that will format your source code to the same format used in Quarkus core.
ja_jp: `quarkiverse-parent` アーティファクト(Quarkiverseの各エクステンションに継承されています)は、プラグインがソースコードをQuarkusコアで使用されているのと同じフォーマットにフォーマットすることを可能にします。

source: The `quarkus-amazon-lambda` extension allows you to use Quarkus to build your AWS Lambdas. Your lambdas can use injection annotations from CDI or Spring and other Quarkus facilities as you need them.
ja_jp: `quarkus-amazon-lambda` エクステンションを使うと、Quarkusを使ってAWS Lambda を構築することができます。Lambda では、CDIやSpringからのインジェクションアノテーションや、必要に応じてQuarkusの他の機能を使用することができます。

source: The `quarkus-amazon-lambda` extension scans your project for a class that directly implements the Amazon `RequestHandler<?, ?>` or `RequestStreamHandler` interface. It must find a class in your project that implements this interface or it will throw a build time failure. If it finds more than one handler class, a build time exception will also be thrown.
ja_jp: `quarkus-amazon-lambda` エクステンションは、Amazon `RequestHandler<?, ?>` または `RequestStreamHandler` インターフェイスを直接実装しているクラスをプロジェクト内でスキャンします。このインターフェイスを実装しているクラスがプロジェクト内で見つかるようにしなければならず、そうでない場合にはビルド時に例外がスローされます。複数のハンドラークラスを見つけた場合にも、ビルド時の例外がスローされます。

source: The `quarkus-amazon-lambda` extension scans your project for a class that directly implements the Amazon `RequestHandler<?, ?>` or `RequestStreamHandler` interface. It must find a class in your project that implements this interface, or it will throw a build time failure. If it finds more than one handler class, a build time exception will also be thrown.
ja_jp: `quarkus-amazon-lambda` エクステンションは、Amazon `RequestHandler<?, ?>` または `RequestStreamHandler` インターフェースを直接実装しているクラスがないか、プロジェクトをスキャンします。このインターフェイスを実装しているクラスがプロジェクト内で見つからなければ、ビルド時の失敗がスローされます。複数のハンドラクラスが見つかった場合も、ビルド時の例外がスローされます。

source: The `quarkus-apicurio-registry-avro` extension depends on recent versions of Apicurio Registry client, and most versions of Apicurio Registry server and client are backwards compatible. For some you need to make sure that the client used by Serdes is compatible with the server.
ja_jp: `quarkus-apicurio-registry-avro` エクステンションは、最近のバージョンのApicurio Registryクライアントに依存しており、Apicurio Registryサーバーとクライアントのほとんどのバージョンには後方互換性があります。一部では、Serdesで使用するクライアントがサーバーと互換性があることを確認する必要があります。

source: The `quarkus-apicurio-registry-json-schema` extension depends on recent versions of Apicurio Registry client, and most versions of Apicurio Registry server and client are backwards compatible. For some you need to make sure that the client used by Serdes is compatible with the server.
ja_jp: `quarkus-apicurio-registry-json-schema` エクステンションは、最近のバージョンの Apicurio Registry クライアントに依存しています。 Apicurio Registry サーバーおよびクライアントのほとんどのバージョンには後方互換性があります。 場合によっては、Serdes で使用するクライアントがサーバーと互換性があることを確認する必要があります。

source: The `quarkus-azure-functions-http` extension allows you to write microservices with Quarkus REST (our Jakarta REST implementation), Undertow (servlet), Reactive Routes, or xref:funqy-http.adoc[Funqy HTTP] and make these microservices deployable to the Azure Functions runtime. In other words, this extension is a bridge from the Azure Functions HttpTrigger and the Quarkus family of HTTP APIs. One azure function deployment can represent any number of Jakarta REST, servlet, Reactive Routes, or xref:funqy-http.adoc[Funqy HTTP] endpoints.
ja_jp: `quarkus-azure-functions-http` エクステンションを使用すると、Quarkus REST (Jakarta REST 実装) を使用してマイクロサービスを作成できます。 Undertow (servlet)、Reactive Routes、または xref:funqy-http.adoc[Funqy HTTP] を使用して、これらのマイクロサービスを Azure Functions ランタイムにデプロイできるようにします。 言い換えれば、このエクステンションは Azure Functions HttpTrigger と HTTP API の Quarkus ファミリーのブリッジとして機能します。 1 つの Azure 関数のデプロイメントは、任意の数の Jakarta REST、サーブレット、Reactive Routes、または xref:funqy-http.adoc[Funqy HTTP] のエンドポイントを表現できます。

source: The `quarkus-azure-functions-http` extension allows you to write microservices with RESTEasy (JAX-RS), Undertow (servlet), Reactive Routes, or xref:funqy-http.adoc[Funqy HTTP] and make these microservices deployable to the Azure Functions runtime.
ja_jp: `quarkus-azure-functions-http` エクステンションを使用すると、RESTEasy（JAX-RS）、Undertow（サーブレット）、Reactive Routes、 xref:funqy-http.adoc[Funqy HTTP] を使用してマイクロサービスを記述し、これらのマイクロサービスを Azure Functions ランタイムにデプロイできるようになります。

source: The `quarkus-azure-functions-http` extension allows you to write microservices with RESTEasy Reactive (JAX-RS), Undertow (servlet), Reactive Routes, or xref:funqy-http.adoc[Funqy HTTP] and make these microservices deployable to the Azure Functions runtime.
ja_jp: `quarkus-azure-functions-http` エクステンションは、RESTEasy（JAX-RS）、Undertow（サーブレット）、Reactive Routes、 link:funqy-http.html[Funqy HTTP] でマイクロサービスを記述し、これらのマイクロサービスをAzure Functionsランタイムにデプロイ可能にします。

source: The `quarkus-azure-functions-http` extension handles all the work to deploy to Azure. By default, Quarkus will use the Azure CLI in the background to authenticate and deploy to Azure. If you have multiple subscriptions associated with your account, you must set the `quarkus.azure-functions.subscription-id` property in your `application.properties` file to the subscription you want to use. For other authentication mechanisms and deployment options see our config properties xref:all-config.adoc[here].
ja_jp: `quarkus-azure-functions-http` エクステンションは Azure へのデプロイ作業をすべて処理します。デフォルトでは、 Quarkus はバックグラウンドで Azure CLI を使用して認証し、Azure へのデプロイを行います。 アカウントに複数のサブスクリプションが関連付けられている場合、使用するサブスクリプションを指定するために、 `application.properties` ファイルに `quarkus.azure-functions.subscription-id` プロパティーを設定する必要があります。 その他の認証メカニズムやデプロイオプションについては、xref:all-config.adoc[こちら] から設定プロパティーを参照してください。

source: The `quarkus-azure-functions-http` extension handles all the work to deploy to Azure. By default, Quarkus will use the Azure CLI in the background to authenticate and deploy to Azure. If you have multiple subscriptions associated with your account, you must set the `quarkus.azure-functions.subscription-id` property in your `application.properties` file to the subscription you want to use. For other authentication mechanisms and deployment options, see <<#configuration-reference>>.
ja_jp: `quarkus-azure-functions-http` エクステンションは Azure へのデプロイ作業をすべて処理します。デフォルトでは、Quarkus はバックグラウンドで Azure CLI を使用して認証し、Azure へのデプロイを行います。アカウントに複数のサブスクリプションが関連付けられている場合、使用するサブスクリプションを指定するために、`application.properties` ファイルに `quarkus.azure-functions.subscription-id` プロパティーを設定する必要があります。その他の認証メカニズムやデプロイオプションについては、<<#configuration-reference>> を参照してください。

source: The `quarkus-azure-functions` extension handles all the work to deploy to Azure. By default, Quarkus will use the Azure CLI in the background to authenticate and deploy to Azure. If you have multiple subscriptions associated with your account, you must set the `quarkus.azure-functions.subscription-id` property in your `application.properties` file to the subscription you want to use. For other authentication mechanisms and deployment options see our config properties xref:all-config.adoc[here].
ja_jp: `quarkus-azure-functions` エクステンションは Azure へのデプロイ作業をすべて処理します。デフォルトでは、 Quarkus はバックグラウンドで Azure CLI を使用して認証し、Azure へのデプロイを行います。 アカウントに複数のサブスクリプションが関連付けられている場合、使用するサブスクリプションを指定するために、 `application.properties` ファイルに `quarkus.azure-functions.subscription-id` プロパティーを設定する必要があります。 その他の認証メカニズムやデプロイオプションについては、xref:all-config.adoc[こちら] から設定プロパティーを参照してください。

source: The `quarkus-azure-functions` extension handles all the work to deploy to Azure. By default, Quarkus will use the Azure CLI in the background to authenticate and deploy to Azure. If you have multiple subscriptions associated with your account, you must set the `quarkus.azure-functions.subscription-id` property in your `application.properties` file to the subscription you want to use. For other authentication mechanisms and deployment options, see our config properties <<#configuration-reference>>.
ja_jp: `quarkus-azure-functions` エクステンションは、Azure へのデプロイに関するすべての作業を処理します。デフォルトでは、Quarkus はバックグラウンドで Azure CLI を使用して Azure に対して認証を行い、デプロイします。アカウントに複数のサブスクリプションが関連付けられている場合、`application.properties` ファイルの `quarkus.azure-functions.subscription-id` プロパティーを、使用したいサブスクリプションに設定する必要があります。その他の認証メカニズムおよびデプロイオプションについては、設定プロパティー <<#configuration-reference>> を参照してください。

source: The `quarkus-azure-functions` extension is a simple integration point between Azure Functions and Quarkus. It interacts with Azure Functions runtime to bootstrap Quarkus and turns any Azure Functions class you write into a CDI/ArC bean.
ja_jp: `quarkus-azure-functions` エクステンションは、Azure Functions と Quarkus のシンプルな統合ポイントです。Azure Functions ランタイムと連携して Quarkus をブートストラップし、記述する Azure Functions クラスを CDI/ArC Bean に変換します。

source: The `quarkus-azure-functions` extension is a simple integration point between Azure Functions and Quarkus. It interacts with Azure Functions runtime to bootstrap quarkus and turns any Azure Functions class you write into a CDI/Arc bean.
ja_jp: `quarkus-azure-functions` エクステンションは、Azure FunctionsとQuarkusの間のシンプルな結合ポイントです。Azure Functionsランタイムと連動してQuarkusをブートストラップし、書いたAzure FunctionsクラスをCDI/Arc Beanに変えることができます。

source: The `quarkus-bom` aligns your dependencies with those used by Quarkus during the augmentation phase.
ja_jp: `quarkus-bom` は、オーグメンテーションの段階で Quarkus が使用している依存関係を調整します。

source: The `quarkus-bootstrap-maven-plugin:extension-descriptor` Maven goal, that generates the extension descriptor, allows to declare provided capabilities in the following way:
ja_jp: エクステンション記述子を生成する `quarkus-bootstrap-maven-plugin:extension-descriptor` Maven ゴールでは、提供されたケイパビリティを以下のように宣言できます。

source: The `quarkus-bootstrap-maven-plugin` has been deprecated in favor of the `quarkus-extension-maven-plugin`.
ja_jp: `quarkus-bootstrap-maven-plugin` は非推奨となり、 `quarkus-extension-maven-plugin` が採用されました。

source: The `quarkus-cache` extension was automatically generating cache keys from method parameters without a way to customize them.
ja_jp: `quarkus-cache` エクステンションは、キャッシュキーをカスタマイズする方法なしに、メソッドパラメータから自動的にキャッシュキーを生成していました。

source: The `quarkus-camel-bom` import is now reported as 'unnecessary' since none of the Quarkus extensions it includes are found among the project dependencies
ja_jp: `quarkus-camel-bom` のインポートは、Quarkus のエクステンションがプロジェクトの依存関係にないため、 'unnecessary' と報告されるようになりました。

source: The `quarkus-container-image-docker` extension is capable of https://docs.docker.com/buildx/working-with-buildx/#build-multi-platform-images/[creating multi-platform (or multi-arch)] images using https://docs.docker.com/engine/reference/commandline/buildx_build/[`docker buildx build`]. See the `quarkus.docker.buildx.*` configuration items in the <<#DockerOptions,Docker Options>> section below.
ja_jp: `quarkus-container-image-docker` エクスンテンションは、link:https://docs.docker.com/engine/reference/commandline/buildx_build/[`docker buildx build`] を使って、 link:https://docs.docker.com/buildx/working-with-buildx/#build-multi-platform-images/[マルチプラットフォーム (またはマルチアーキ]) イメージを作成することができます。以下の link:#DockerOptions[Dockerオプション] のセクションにある `quarkus.docker.buildx.*` の設定項目を参照してください。

source: The `quarkus-container-image-docker` extension is capable of https://docs.docker.com/buildx/working-with-buildx/#build-multi-platform-images/[creating multi-platform (or multi-arch)] images using https://docs.docker.com/engine/reference/commandline/buildx_build/[`docker buildx build`]. See the `quarkus.docker.buildx.*` configuration items in the xref:DockerOptions[Docker Options] section below.
ja_jp: `quarkus-container-image-docker` エクステンションは、 link:https://docs.docker.com/engine/reference/commandline/buildx_build/[`docker buildx build`] を用いて link:https://docs.docker.com/buildx/working-with-buildx/#build-multi-platform-images/[マルチプラットフォーム（またはマルチアーキ）イメージを作成する] 機能を備えています。 後述の Docker xref:DockerOptions[オプション] セクションの `quarkus.docker.buildx.*` の設定項目を参照してください。

source: The `quarkus-elytron-security-ldap` extension requires a dir-context and an identity-mapping with at least one attribute-mapping to authenticate the user and its identity.
ja_jp: `quarkus-elytron-security-ldap` エクステンションは、ユーザーとそのIDを認証するために、dir-contextと、少なくとも1つのattribute-mappingを持つidentity-mappingを必要とします。

source: The `quarkus-extension-b`, in this example, may or may not define its own condition to be evaluated.
ja_jp: この例では、 `quarkus-extension-b` は、評価される独自の条件を定義する場合と定義しない場合があります。

source: The `quarkus-extension-maven-plugin:extension-descriptor` Maven goal and the `extensionDescriptor` Gradle task, that generate extension descriptors, allow configuring provided and required capabilities in the following way:
ja_jp: `quarkus-extension-maven-plugin:extension-descriptor` Maven ゴールと `extensionDescriptor` Gradle タスクはエクステンション記述子を生成し、次の方法で provided および required のケイパビリティを設定できます:

source: The `quarkus-extension-maven-plugin` is configured in the runtime module of a Quarkus extension Maven project and serves the following purposes:
ja_jp: `quarkus-extension-maven-plugin` は、Quarkus 拡張 Maven プロジェクトのランタイムモジュールで設定され、次の目的を果たします。

source: The `quarkus-extension.yaml` file (in the extension's `runtime/` module) has the minimum metadata set:
ja_jp: `quarkus-extension.yaml` ファイル（エクステンションの `runtime/` モジュール内）には、最小限のメタデータが設定されています。

source: The `quarkus-google-cloud-functions-http` extension allows you to write microservices with Quarkus REST (Jakarta REST), Undertow (Servlet), Reactive Routes, or xref:funqy-http.adoc[Funqy HTTP], and make these microservices deployable to the Google Cloud Functions runtime.
ja_jp: `quarkus-google-cloud-functions-http` エクステンションを使用すると、Quarkus REST（Jakarta REST）、Undertow（サーブレット）、Reactive Routes、または xref:funqy-http.adoc[Funqy HTTP] を使用してマイクロサービスを記述し、これらのマイクロサービスを Google Cloud Functions ランタイムにデプロイできるようになります。

source: The `quarkus-google-cloud-functions-http` extension allows you to write microservices with RESTEasy (JAX-RS), Undertow (Servlet), Reactive Routes, or xref:funqy-http.adoc[Funqy HTTP], and make these microservices deployable to the Google Cloud Functions runtime.
ja_jp: `quarkus-google-cloud-functions-http` エクステンションを使用すると、RESTEasy (JAX-RS), Undertow (Servlet), Reactive Routes, xref:funqy-http.adoc[Funqy HTTP] を使用してマイクロサービスを記述し、これらのマイクロサービスを Google Cloud Functions ランタイムにデプロイすることができます。

source: The `quarkus-google-cloud-functions-http` extension allows you to write microservices with RESTEasy Reactive (JAX-RS), Undertow (Servlet), Reactive Routes, or xref:funqy-http.adoc[Funqy HTTP], and make these microservices deployable to the Google Cloud Functions runtime.
ja_jp: `quarkus-google-cloud-functions-http` エクステンションは、RESTEasy（JAX-RS）、Undertow（Servlet）、Reactive Routes、 link:funqy-http.html[Funqy HTTP] でマイクロサービスを記述し、これらのマイクロサービスをGoogle Cloud Functionsランタイムにデプロイ可能にします。

source: The `quarkus-google-cloud-functions-http` extension allows you to write microservices with RESTEasy Reactive (Jakarta REST), Undertow (Servlet), Reactive Routes, or xref:funqy-http.adoc[Funqy HTTP], and make these microservices deployable to the Google Cloud Functions runtime.
ja_jp: `quarkus-google-cloud-functions-http` エクステンションは、RESTEasy Reactive (Jakarta REST), Undertow (Servlet), Reactive Routes, xref:funqy-http.adoc[Funqy HTTP] でマイクロサービスを書き、これらのマイクロサービスをGoogle Cloud Functionsのランタイムにデプロイできるようにするものです。
